Macaulay2, version 1.18
with packages: ConwayPolynomials, Elimination, IntegralClosure, InverseSystems, LLLBases,
               MinimalPrimes, PrimaryDecomposition, ReesAlgebra, Saturation, TangentCone

i1 : R = QQ[x_1, x_2]

o1 = R

o1 : PolynomialRing

i2 : 
     p = x_1^4 + x_2^4 - 2/3

      4    4   2
o2 = x  + x  - -
      1    2   3

o2 : R

i3 : 
     M = image diff(matrix{{x_1, x_2}}, p)

o3 = image | 4x_1^3 4x_2^3 |

                             1
o3 : R-module, submodule of R

i4 : J = quotient(M, p)

o4 = image | x_2^3 x_1^3 |

                             1
o4 : R-module, submodule of R

i5 : G = gens gb J

o5 = | x_2^3 x_1^3 |

             1       2
o5 : Matrix R  <--- R

i6 : G0 = gens gb ideal M

o6 = | x_2^3 x_1^3 |

             1       2
o6 : Matrix R  <--- R

i7 : L = (G0 * transpose(G0))_(0, 0)

      6    6
o7 = x  + x
      1    2

o7 : R

i8 : 
     st = diff(matrix{{x_1, x_2}}, p) | matrix{{L * p}}

o8 = | 4x_1^3 4x_2^3 x_1^10+x_1^6x_2^4+x_1^4x_2^6+x_2^10-2/3x_1^6-2/3x_2^6 |

             1       3
o8 : Matrix R  <--- R

i9 : gf = syz st

o9 = {3}  | x_2^3  -3x_1^7-3x_1^3x_2^4-3x_1x_2^6+2x_1^3 |
     {3}  | -x_1^3 -3x_2^7+2x_2^3                       |
     {10} | 0      12                                   |

             3       2
o9 : Matrix R  <--- R

i10 : h = gf_{0}^{0, 1}

o10 = {3} | x_2^3  |
      {3} | -x_1^3 |

              2       1
o10 : Matrix R  <--- R

i11 : 
      f = 1 / substitute(gf_(2, 1), QQ) * (gf_{1}^{0, 1})

o11 = {3} | -1/4x_1^7-1/4x_1^3x_2^4-1/4x_1x_2^6+1/6x_1^3 |
      {3} | -1/4x_2^7+1/6x_2^3                           |

              2       1
o11 : Matrix R  <--- R

i12 : M = h | matrix{{p, 0}, {0, p}} | f

o12 = {3} | x_2^3  x_1^4+x_2^4-2/3 0              
      {3} | -x_1^3 0               x_1^4+x_2^4-2/3
      ----------------------------------------------------------------------------------------
      -1/4x_1^7-1/4x_1^3x_2^4-1/4x_1x_2^6+1/6x_1^3 |
      -1/4x_2^7+1/6x_2^3                           |

              2       4
o12 : Matrix R  <--- R

i13 : R = syz M

o13 = {6}  | 3x_1^4+3x_2^4-2 3x_1x_2^3 |
      {4}  | -3x_2^3         3x_1^3    |
      {4}  | 3x_1^3          3x_2^3    |
      {10} | 0               12        |

                         4                  2
o13 : Matrix (QQ[x ..x ])  <--- (QQ[x ..x ])
                  1   2              1   2

i14 : 
      Y = R_(0, 0)

        4     4
o14 = 3x  + 3x  - 2
        1     2

o14 : QQ[x ..x ]
          1   2

i15 : y = substitute(1 / R_(3, 1), QQ) * R_(0, 1)

      1   3
o15 = -x x
      4 1 2

o15 : QQ[x ..x ]
          1   2

i16 : f0 = f + h * y

o16 = {3} | -1/4x_1^7-1/4x_1^3x_2^4+1/6x_1^3 |
      {3} | -1/4x_1^4x_2^3-1/4x_2^7+1/6x_2^3 |

                         2                  1
o16 : Matrix (QQ[x ..x ])  <--- (QQ[x ..x ])
                  1   2              1   2
