Macaulay2, version 1.22
with packages: ConwayPolynomials, Elimination, IntegralClosure, InverseSystems, Isomorphism,
               LLLBases, MinimalPrimes, OnlineLookup, PrimaryDecomposition, ReesAlgebra,
               Saturation, TangentCone

i1 : R = QQ[x_1,x_2]

o1 = R

o1 : PolynomialRing

i2 : 
     p = x_1^2 + x_2^2 - 1

      2    2
o2 = x  + x  - 1
      1    2

o2 : R

i3 : 
     dp = image diff(matrix{{x_1, x_2}}, p)

o3 = image | 2x_1 2x_2 |

                             1
o3 : R-module, submodule of R

i4 : J = quotient(dp, p)

o4 = image | x_2 x_1 |

                             1
o4 : R-module, submodule of R

i5 : G = gens gb J

o5 = | x_2 x_1 |

             1       2
o5 : Matrix R  <--- R

i6 : Lambda = (G * transpose(G))_(0, 0)

      2    2
o6 = x  + x
      1    2

o6 : R

i7 : 
     st = diff(matrix{{x_1, x_2}}, p) | matrix{{Lambda * p}}

o7 = | 2x_1 2x_2 x_1^4+2x_1^2x_2^2+x_2^4-x_1^2-x_2^2 |

             1       3
o7 : Matrix R  <--- R

i8 : gf = syz st

o8 = {1} | x_2  -x_1^3-2x_1x_2^2+x_1 |
     {1} | -x_1 -x_2^3+x_2           |
     {4} | 0    2                    |

             3       2
o8 : Matrix R  <--- R

i9 : 
     h = gf_{0}^{0,1}

o9 = {1} | x_2  |
     {1} | -x_1 |

             2       1
o9 : Matrix R  <--- R

i10 : f = 1 / substitute(gf_(2, 1), QQ) * (gf_{1}^{0, 1})

o10 = {1} | -1/2x_1^3-x_1x_2^2+1/2x_1 |
      {1} | -1/2x_2^3+1/2x_2          |

              2       1
o10 : Matrix R  <--- R

i11 : 
      M2 = h | matrix{{p, 0}, {0, p}} | f

o11 = {1} | x_2  x_1^2+x_2^2-1 0             -1/2x_1^3-x_1x_2^2+1/2x_1 |
      {1} | -x_1 0             x_1^2+x_2^2-1 -1/2x_2^3+1/2x_2          |

              2       4
o11 : Matrix R  <--- R

i12 : R = syz M2

o12 = {2} | x_1^2+x_2^2-1 x_1x_2 |
      {2} | -x_2          x_1    |
      {2} | x_1           x_2    |
      {4} | 0             2      |

                         4                  2
o12 : Matrix (QQ[x ..x ])  <--- (QQ[x ..x ])
                  1   2              1   2

i13 : 
      Y = R_(0,0)

       2    2
o13 = x  + x  - 1
       1    2

o13 : QQ[x ..x ]
          1   2

i14 : y = substitute(1 / R_(3, 1), QQ) * R_(0, 1)

      1
o14 = -x x
      2 1 2

o14 : QQ[x ..x ]
          1   2

i15 : 
      f0 = f + h * y

o15 = {1} | -1/2x_1^3-1/2x_1x_2^2+1/2x_1 |
      {1} | -1/2x_1^2x_2-1/2x_2^3+1/2x_2 |

                         2                  1
o15 : Matrix (QQ[x ..x ])  <--- (QQ[x ..x ])
                  1   2              1   2
